$ l1
> (quote foo)
foo
> 'foo
foo
> '123
123
> (quote (the (ten (laws (of (greenspun))))))
(the (ten (laws (of (greenspun)))))
> (= (quote foo) (quote foo))
t
> (= (quote foo) (quote bar))
()
> (= (quote foo) (quote (foo bar)))
()
> (atom (quote (foo bar)))
()
> (atom (quote atom))
t
> (cond (() 1) (2 3))
3
> (car '(1 2 3))
1
> (cdr '(1 2 3))
(2 3)
> (cons 1 '(2 3 4))
(1 2 3 4)
> (def a 6)
6
> (def b 7)
7
> (+ a b)
13
> (help)
Builtins and Special Forms:
      Name  Arity    Description
         *    0+     Multiply 0 or more numbers
         +    0+     Add 0 or more numbers
         -    1+     Subtract 0 or more numbers from the first argument
         /    2+     Divide the first argument by the rest
         <    1+     Return t if the arguments are in strictly increasing order, () otherwise
        <=    1+     Return t if the arguments are in increasing (or qual) order, () otherwise
         =    1+     Return t if the arguments are equal, () otherwise
         >    1+     Return t if the arguments are in strictly decreasing order, () otherwise
        >=    1+     Return t if the arguments are in decreasing (or equal) order, () otherwise
     apply    2      Apply a function to a list of arguments
      atom    1      Return true if the argument is an atom, false otherwise
       car    1      Return the first element of a list
       cdr    1      Return a list with the first element removed
      cond    0+     SPECIAL FORM: Conditional branching
      cons    2      Add an element to the front of a (possibly empty) list
       def    2      SPECIAL FORM: Set a value
    errors    1+     SPECIAL FORM: Error checking (for tests)
      fuse    1      Fuse a list of numbers or atoms into a single atom
      help    0      Print this message
        is    1      Assert that the argument is truthy (not ())
    lambda    1+     SPECIAL FORM: Create a function
       len    1      Return the length of a list
      neg?    1      Return true if the (numeric) argument is negative, else ()
       not    1      Return t if the argument is nil, () otherwise
      pos?    1      Return true if the (numeric) argument is positive, else ()
     print    0+     Print the arguments
     quote    1      SPECIAL FORM: Quote an expression
 randigits    1      Return a list of random digits of the given length
     split    0      Split an atom or number into a list of single-digit numbers or single-character atoms
      test    0+     Establish a testing block (return last expression)
     zero?    1      Return t if the argument is zero, () otherwise
> ^D
$
